import matplotlib.pyplot as plt

# Данные из таблицы
P_Torr = [0.094, 0.216, 0.3, 0.379, 0.454, 0.526, 0.597, 0.669, 0.739, 0.81, 
          0.879, 0.931, 0.933, 0.931, 0.884, 0.815, 0.746, 0.675, 0.602, 0.531, 
          0.457, 0.38, 0.298, 0.209, 0.082]

S_l_s = [0, 0.295, 0.425, 0.504, 0.560, 0.604, 0.638, 0.664, 0.687, 0.705, 
         0.722, 0.755, 0.757, 0.754, 0.718, 0.701, 0.680, 0.658, 0.633, 0.598, 
         0.556, 0.502, 0.428, 0.307, 0]

# Разделяем на прямой и обратный ход
P_forward = P_Torr[:13]
S_forward = S_l_s[:13]
P_backward = P_Torr[12:]
S_backward = S_l_s[12:]

plt.figure(figsize=(10, 6))
plt.plot(P_forward, S_forward, 'bo-', label='Увеличение потока')
plt.plot(P_backward, S_backward, 'ro-', label='Уменьшение потока')
plt.xlabel('Давление P, Торр')
plt.ylabel('Быстрота действия S, л/с')
# plt.title('Зависимость быстроты действия форвакуумного насоса от давления')
plt.legend()
plt.grid(True)
plt.savefig('2 S(P).pdf')
plt.show()